InformationRegisters/УведомлениеОВыходеНовыхВерсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>УведомлениеОВыходеНовыхВерсий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеПоказывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыхода</Name>
					<Comment>Дата выхода строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/УведомлениеОВыходеНовыхВерсий/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//МассивРезультата = Неопределено;
	//Если МассивРезультата = Неопределено Тогда
	//	Закрыть();
	//Иначе
	//	ТаблицаДанных.Очистить();
	//	Для чНом=0 По МассивРезультата.Количество()-1 Цикл
	//		НоваяСтрока = ТаблицаДанных.Добавить();
	//		ЗаполнитьЗначенияСвойств(НоваяСтрока, МассивРезультата[чНом]);
	//	КонецЦикла;
	//КонецЕсли;
	
	//ПроверитьВерсииНеПоказывать();
	
	//Проверим, что есть хотя бы одна версия, которую надо показывать
	//КоличествоВерсий = 0;
	//Для Каждого ТекСтрока Из ТаблицаДанных Цикл
	//	Если НЕ ТекСтрока.НеПоказывать Тогда
	//		КоличествоВерсий = КоличествоВерсий + 1;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	
	//ТаблицаДанных заполняется при создании на сервере
	Если ТаблицаДанных.Количество() = 0 Тогда
		Закрыть();
	Иначе
		СфорироватьТабличныйДокуент();
	КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ПроверитьВерсииНеПоказывать()
//	
//	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
//		Запрос = Новый Запрос;
//		Запрос.Текст = 
//		"ВЫБРАТЬ
//		|	УведомлениеОВыходеНовыхВерсий.НеПоказывать КАК НеПоказывать
//		|ИЗ
//		|	РегистрСведений.УведомлениеОВыходеНовыхВерсий КАК УведомлениеОВыходеНовыхВерсий
//		|ГДЕ
//		|	УведомлениеОВыходеНовыхВерсий.Версия = &Версия
//		|	И УведомлениеОВыходеНовыхВерсий.Пользователь = &Пользователь";
//		Запрос.УстановитьПараметр("Версия", ТекСтрока.НомерВерсии);
//		Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
//		Выборка = Запрос.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл
//			ТекСтрока.НеПоказывать = Выборка.НеПоказывать;
//		КонецЦикла;
//	КонецЦикла;
//	
//КонецПроцедуры

&НаСервере
Процедура СфорироватьТабличныйДокуент()
	
	Макет = ПолучитьОбщийМакет("УведомлениеОВыходеНовойВерсии");
	Таб = Новый ТабличныйДокумент;	
	//ТаблицаДанных.Сортировать("ДатаВыхода Убыв");
	
	Для Каждого ТекСтрока Из ТаблицаДанных Цикл
		Если НЕ ТекСтрока.НеПоказывать Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Версия");
			ОбластьМакета.Параметры.НомерВерсии = ТекСтрока.НомерВерсии;
			ОбластьМакета.Параметры.ДатаВыхода = Формат(ТекСтрока.ДатаВыхода,"ДЛФ=Д");
			ОбластьМакета.Параметры.Описание = СтрЗаменить(ТекСтрока.Описание,"<br/>",Символы.ПС);
			Таб.Вывести(ОбластьМакета);
		КонецЕсли;
	КонецЦикла;
	
	Результат.Очистить();
	Результат.Вывести(Таб);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере()
	
	Если НеПоказывать Тогда
		Для Каждого ТекЗапись Из ТаблицаДанных Цикл
			МенеджерЗаписи = РегистрыСведений.УведомлениеОВыходеНовыхВерсий.СоздатьМенеджерЗаписи();
			
			МенеджерЗаписи.Версия = ТекЗапись.НомерВерсии;
			МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
			МенеджерЗаписи.НеПоказывать = НеПоказывать;
			МенеджерЗаписи.Описание = ТекЗапись.Описание;
			МенеджерЗаписи.ДатаВыхода = ТекЗапись. ДатаВыхода;
			
			МенеджерЗаписи.Записать();
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	ПриЗакрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьЗаявкуНаОбновление(Команда)
	
	Парам = Новый Структура;
	Парам.Вставить("ТекстЗапроса","Прошу обновить нашу конфигурацию до самой последней версии");
	ОткрытьФорму("ОбщаяФорма.ФормаОтправкиЗапроса", Парам,,,,,Новый ОписаниеОповещения("ПослеОтправкиЗапроса",ЭтаФорма),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеОтправкиЗапроса(Успешно) Экспорт
	
	Если Успешно Тогда
		НеПоказывать = Истина;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РезультатПроверки = ОбщийМодуль.ОпределитьМассивПеременныхСеанса();
	Если РезультатПроверки.Лицензия и НЕ РезультатПроверки.Поддержка  Тогда
		Если РезультатПроверки.Коробка = 0 Тогда
				//коробка
				Элементы.ИнформационныйТекстНетПоддержки.Заголовок = "ВНИМАНИЕ! У Вас завершился срок действия договора сопровождения!
					|
					|При отсутствии действующего договора сопровождения не доступны:
					|* обновления программы
					|* консультации по настройке и работе в программе
					|* индивидуальные настройки и доработки
					|* дополнительные сервисы и интеграция с другими программами
					|(более подробный список расширенного функционала при наличии ИТС см. на сайте разработчика)
					|
					|Вам необходимо обратиться в отдел продаж или техническую службу разработчика.
					|
					|Информационно техническое сопровождение (ИТС) осуществляется только при наличии активной подписки и по актуальным версиям конфигураций.  
					|Для восстановления не продленного договора ИТС необходимо иметь актуальную версию конфигурации.Стоимость установки обновлений в таких случаях определяется индивидуально.
					|";
			ИначеЕсли РезультатПроверки.Коробка = 1 Тогда
				//облако
				Элементы.ИнформационныйТекстНетПоддержки.Заголовок = "ВНИМАНИЕ! У Вас завершился срок аренды программы!
					|
					|ПРОГРАММА ДОСТУПНА ТОЛЬКО В РЕЖИМЕ ПРОСМОТРА.
					|
					|ВСЕ ПОЛЬЗОВАТЕЛЬСКИЕ ДАННЫЕ БУДУТ УДАЛЕНЫ ЧЕРЕЗ МЕСЯЦ ПОСЛЕ ОКОНЧАНИЯ АРЕНДЫ БЕЗ ВОЗВОЖНОСТИ ВОССТАНОВЛЕНИЯ.
					|
					|Вам необходимо обратиться в отдел продаж или техническую службу разработчика.
					|";
			ИначеЕсли РезультатПроверки.Коробка = 2 Тогда
				//облако
				Элементы.ИнформационныйТекстНетПоддержки.Заголовок = "ВНИМАНИЕ! У Вас завершился срок аренды программы!
					|
					|ПРОГРАММА ДОСТУПНА ТОЛЬКО В РЕЖИМЕ ПРОСМОТРА.
					|
					|Вам необходимо обратиться в отдел продаж или техническую службу разработчика.
					|";
			КонецЕсли;
		Элементы.ИнформационныйТекстНетПоддержки.Видимость = Истина;
	КонецЕсли;
	
	ДанныеОНовыхВерсиях = ОбщийМодуль.ПолучитьСведенияОНовыхВерсияхИзРегистра();
	
	Для Каждого ТекущаяСтрока Из ДанныеОНовыхВерсиях Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры
